package com.ya02wmsj_cecoe.linhaimodule.rx;

import java.util.HashMap;
import java.util.Map;

/**
 * @author Yang Shihao
 */
public enum HttpCode {
    CODE_0("0", "操所成功"),
    CODE_0004("0004", "已报名，请不要重复操作"),
    CODE_0009("0009", "用户未绑定"),
    CODE_0013("0013", "已申请，请不要重复操作"),
    CODE_0119("0119", "尚未开始报名"),
    CODE_4030("4030", "志愿者未登录"),
    CODE_10001("10001", "登录成功"),
    CODE_20000("20000", "登录失败"),
    CODE_1001("1001", "登录信息失效"),
    CODE_20001("20001", "操作失败"),
    CODE_20005("20005", "TOKEN错误或者已失效"),
    CODE_20006("20006", "参数错误"),
    CODE_20007("20007", "没有操作权限！"),
    CODE_20008("20008", "注册失败！"),
    CODE_20009("20009", "未知错误！"),
    CODE_20010("20010", "您已投过票，请勿重复投票！"),
    CODE_20011("20011", "上传数量超过限制！"),
    CODE_20012("20012", "当前用户没有绑定区域或者绑定未审核通过！"),
    CODE_20013("20013", "未查询到相关数据！"),
    CODE_20014("20014", "数据重复！"),
    CODE_20015("20015", "数据未发生任何改变！"),
    CODE_20018("20018", "会话已过期或者无效！"),
    CODE_20021("20021", "该账户无手机端权限，管理员授权后方可登录！"),
    CODE_20022("20022", "该账户已和其他手机绑定，请使用绑定的手机进行登录！"),
    CODE_20023("20023", "该事件已处理完毕，不能再处理！"),
    CODE_20024("20024", "该事件已是最高级别，不能再上报！"),
    CODE_20025("20025", "请上传焦点图，再操作！"),
    CODE_20027("20027", "请先选择区域，再操作！"),
    CODE_20028("20028", "事件已完结或者已经在处理中，无法编辑！"),
    CODE_20029("20029", "签到失败"),
    CODE_20033("20033", "数据错误"),
    CODE_20034("20034", "证件号码有误"),
    CODE_20037("20037", "不能重复点赞！"),
    CODE_20040("20040", "同步信息到网易云失败！"),
    CODE_20041("20041", "用户尚未注册或用户类型不符"),
    CODE_20044("20044", "该身份证号已存在"),
    CODE_20046("20046", "不能投票"),
    CODE_20048("20048", "手机号码有误"),
    CODE_20049("20049", "频道名称已经存在"),
    CODE_20050("20050", "请勿重复操作"),
    CODE_20058("20058", "上传照片失败"),
    CODE_20065("20065", "请勿重复答题"),
    CODE_20066("20066", "题目不存在"),
    CODE_20067("20067", "请绑定手机号码"),
    CODE_20068("20068", "您已认领过此心愿，请勿重复操作!"),
    CODE_20069("20069", "活动未开始"),
    CODE_20070("20070", "活动已结束"),
    CODE_20080("20080", "您不在当前流程处理人列表, 无权处理"),
    CODE_20081("20081", "流程已处理,请不要重复处理"),
    CODE_20082("20082", "您选择的点单区域下暂未安排处理人"),

    CODE_21000("21000", "下一步流程未安排人员，请联系管理员!"),
    CODE_21001("21001", "直播间频道ID为空或格式不正确!"),
    CODE_21002("21002", "区域编码为空或格式不正确!"),
    CODE_21003("21003", "区域层级不正确!"),
    CODE_21004("21004", "栏目ID为空或格式不正确"),
    CODE_21005("21005", "类型标识不正确"),
    CODE_21006("21006", "APP用户操作类型不正确"),
    CODE_21007("21007", "评论操作类型不正确"),
    CODE_21008("21008", "图文和视频不能同时为空"),
    CODE_21009("21009", "服务不存在或已删除！"),
    CODE_21010("21010", "请选择服务！"),

    CODE_21011("21011", "活动类型不正确！"),
    CODE_21012("21012", "活动主题不正确！"),
    CODE_21013("21013", "活动事项不存在！"),
    CODE_21014("21014", "活动流程不存在！"),
    CODE_21015("21015", "手机端暂不支持发布此类型的活动！"),
    CODE_21016("21016", "提交数据为空或格式不正确！"),
    CODE_21017("21017", "活动ID为空或格式不正确！"),
    CODE_21018("21018", "点单活动ID为空或格式不正确！"),
    CODE_21019("21019", "开始时间格式错误！"),
    CODE_21020("21020", "结束时间格式错误！"),

    CODE_21021("21021", "开始时间不得晚于结束时间！"),
    CODE_21022("21022", "当前状态无法修改！！"),
    CODE_21023("21023", "标题不能为空！"),
    CODE_21024("21024", "描述不能为空！"),
    CODE_21025("21025", "姓名不能为空！"),
    CODE_21026("21026", "联系方式不能为空！"),
    CODE_21027("21027", "联系地址不能为空！"),
    CODE_21028("21028", "记录ID为空或格式不正确！"),
    CODE_21029("21029", "不能认领自己发布的心愿！"),
    CODE_21030("21030", "心愿不是“可认领”状态，无法认领！"),

    CODE_21031("21031", "心愿不是“已认领”状态，无法办结！"),
    CODE_21032("21032", "认领记录不存在或已删除！"),
    CODE_21033("21033", "心愿总结不能为空！"),
    CODE_21034("21034", "上传经度为空或格式不正确！"),
    CODE_21035("21035", "上传纬度为空或格式不正确！"),
    CODE_21036("21036", "缺少志愿汇登陆token！"),
    CODE_21037("21037", "缺少志愿汇组织Id！"),
    CODE_21038("21038", "缺少志愿汇招募活动Id！"),
    CODE_21039("21039", "缺少志愿汇签到活动Id！"),
    CODE_21040("21040", "商品编码为空或格式错误!"),

    CODE_21041("21041", "商品不存在或已删除!"),
    CODE_21042("21042", "认领记录不存在或已删除！"),
    CODE_21043("21043", "购买数量为空或格式不正确！"),
    CODE_21044("21044", "商品库存数量不足！"),
    CODE_21045("21045", "商品总价不正确！"),
    CODE_21046("21046", "活动未开始或已结束，无法享受活动价！"),
    CODE_21047("21047", "订单号为空或订单格式不正确！"),
    CODE_21048("21048", "订单不存在或已删除！"),
    CODE_21049("21049", "退还原因不能为空！"),
    CODE_21050("21050", "订单已退还，请不要重复操作!"),

    CODE_21051("21051", "用户益币不足!"),

    CODE_30001("30001", "网络异常,请稍后重试"),
    CODE_30002("30002", "网络请求失败"),
    CODE_30003("30003", "Json解析异常"),
    CODE_40000("40000", "志愿者未登录"),
    CODE_40001("40001", "已申请，请不要重复操作"),
    CODE_40002("40002", "已报名，请不要重复操作"),
    CODE_40003("40003", "用户未绑定"),
    CODE_40004("40004", "报名已截止"),
    CODE_40005("40005", "尚未开始报名"),
    CODE_21052("21052", "兑换次数已达本月上限，请下个月再兑换！");

    public static String SUCCESS_CODE = "0";
    //签到成功
    public static String SIGN_SUCCESS_CODE = "100008";
    //重复签到
    public final static String SIGN_AM_REPEAT_SIGN = "100019";
    public static String TOKEN_CODE = "20005";

    static Map<String, String> mMap = new HashMap<>();

    private String mCode;
    private String mMsg;

    HttpCode(String code, String msg) {
        mCode = code;
        mMsg = msg;
    }

    public String getCode() {
        return mCode;
    }

    public void setCode(String code) {
        mCode = code;
    }

    public String getMsg() {
        return mMsg;
    }

    public void setMsg(String msg) {
        mMsg = msg;
    }

    public static String getMsg(String code) {
        String msg = mMap.get(code);
        return msg == null ? "错误码-" + code + "：未知错误" : msg;
    }

    static {
        for (HttpCode httpCode : HttpCode.values()) {
            mMap.put(httpCode.getCode(), httpCode.getMsg());
        }
    }
}